JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.h
/*
 * Copyright 2021-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_NETC_ENDPOINT_H_
#define _FSL_NETC_ENDPOINT_H_

#include "fsl_netc.h"
#include "netc_hw/fsl_netc_hw.h"
#include "netc_hw/fsl_netc_hw_enetc.h"
#include "netc_hw/fsl_netc_hw_port.h"
#include "netc_hw/fsl_netc_hw_si.h"

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region api_ep
#endif
//////////////////////////////////////
// Group for the End Point Driver
//////////////////////////////////////
/*!
 * @defgroup netc_ep NETC Endpoint (EP) Driver
 * @details API / Data structure for using NETC driver and endpoint.
 * This group handles endpoint devices covering the features to Initialize/De-Initialize the endpoint, transfer
 * packets, configure the port/links, and get the status and statistic. Note that it doesn't cover the phy configuration
 * which shall be configured in MDIO module for both external real PHY and internal virtual PHY.
 *
 * The endpoint API mainly relates to the ENETC IP which interfaces the host to the MAC or Pseudo-MAC (Switch).
 *
 * APIs in this group take the ep_handle_t as first parameter to retrieve the current context.
 * User shall not manipulate the members of the handle without invoking the provided APIs or help macros as it may
 * break the driver state.
 *
 * All API in this groups start with `EP_` and data structure specific to endpoint start with `ep_`.
 *
 * @ingroup netc_api
 */

/*!
 * @defgroup netc_ep_config Endpoint (EP) Generic Configuration
 * @details Generic Ethernet endpoint configuration
 * MAC, host interface and driver configuration.
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_ntmp Endpoint (EP) Table Management Module
 * @details Generic Table Management related functionalities
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_stat Endpoint (EP) Statistic Module
 * @details Statistics counters
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_interrupt Endpoint (EP) Interrupt Module
 * @details Interrupt related functionalities
 *
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_xfer Endpoint (EP) Transmit/Receive
 * @details Data interface for transmit and receive
 *
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_psi_vsi_msg Endpoint (EP) PSI/VSI
 * @details PSI/VSI related functionalities
 *
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_datapath Endpoint (EP) data path
 * @details QoS, classification and filtering functionalities
 * @ingroup netc_ep
 */
/*!
 * @defgroup netc_ep_tx Endpoint (EP) Egress data path configuration
 * @details API/Data structure for configuration of the endpoint ingress datapath
 * This module includes steps below in sequence and APIs are placed following this sequence for user to identify easily
 * - Schedule: Credit Based Shaper also referred as IEEE 802.1 Qav
 * - Schedule: Time Specific Departure
 * - Schedule: Time Gate Scheduling referred as IEEE 802.1 Qbv
 * - VLAN Insert
 *
 * API in this group starts with `EP_Tx`.
 *
 * @ingroup netc_ep_datapath
 */
/*!
 * @defgroup netc_ep_rx Endpoint (EP) Ingress data path configuration
 * @details API/Data structure for configuration of the endpoint ingress datapath.
 * This module includes steps below in sequence and APIs are placed following this sequence for user to identify easily
 * - Parser
 * - VLAN Classification
 * - Ingress QoS Classification
 * - Ingress Port Filtering
 * - Stream Identification and Filtering
 * - L2 Filtering: VLAN/MAC Address
 * - Policying: Rate Policing and Stream Gating
 * - Enqueue (Ingress Congestion Management ICM)
 * - HTA (Host Transfer Agent Rx)
 *
 * API in this group starts with `EP_Rx`.
 *
 * @ingroup netc_ep_datapath
 */

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion api_ep
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_stat
#endif
/*! @addtogroup netc_ep_stat
 * @{
 */

/*! @brief Status/interrupt detect flags merged to same set of enum. TODO SITMRIDR */
typedef enum _ep_flags
{
    kNETC_EPTimerSyncedFlag     = 0x1,
    kNETC_EPICMBlockedFlag      = 0x1 << 1,
    kNETC_EPWakeOnLANActiveFlag = 0x1 << 2,

} ep_flags_t;

/*! @} */ // end of netc_ep_stat
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_stat
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_interrupt
#endif
/*! @addtogroup netc_ep_interrupt
 * @{
 */

/*!
 * @brief Interrupt enable/disable flags.
 *
 * The value of the enumerator is not necessary match the bit in register. All interrupts in Endpoint are
 * merged into this enum except the BDR specific interrupt.
 * TODO SITMRIER
 */
typedef enum _ep_interrupt_flag
{
    kNETC_EPPSIResetInterruptEnable = 0x1,
    kNETC_EPPSIMsgRxInterruptEnable = 0x1 << 1U,
} ep_interrupt_flag_t;

/*! @} */ // end of netc_ep_interrupt
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_interrupt
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_xfer
#endif
/*! @addtogroup netc_ep_xfer
 * @{
 */

typedef enum _ep_rx_flags
{
    kEP_RX_RSS_VALID       = 0x1,       /*!< Request timestamp. */
    kEP_RX_VLAN_VALID      = 0x1 << 1U, /*!< Specifiy frame departure time. */
    kEP_RX_TIMESTAMP_VALID = 0x1 << 2U, /*!< Enable port masquerading. */
} ep_rx_flags_t;

typedef enum _ep_tx_opt_flags
{
    kEP_TX_OPT_REQ_TS      = 0x1U, /*!< Request timestamp (IEEE 1588 PTP two-step timestamp). */
    kEP_TX_OPT_VLAN_INSERT = 0x2U, /*!< Enable VLAN insert. */
    kEP_TX_OPT_START_TIME  = 0x4U, /*!< Specifiy frame departure time. */
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
    kEP_TX_OPT_REQ_ONE_STEP_TS = 0x8U, /*!< Request IEEE 1588 PTP one-step timestamp offload. */
#endif
} ep_tx_opt_flags;

typedef struct _ep_tx_opt
{
    uint32_t flags;             /*!< A bitmask of ep_tx_opt_flags */
    uint32_t timestamp;         /*!< Departure timestamp, used if kEP_TX_OPT_START_TIME is set */
    netc_enetc_vlan_tag_t vlan; /*!< VLAN tag which will be inserted, used if kEP_TX_OPT_VLAN_INSERT is set */
} ep_tx_opt;

