JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.h
/*******************************************************************************
 * API
 ******************************************************************************/

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_config
#endif
/*! @addtogroup netc_ep_config
 * @{
 */

/*!
 * @brief Initialize the endpoint with specified station interface
 *
 * Each station interface needs to call this API. In the case of a virtual station interface
 * it's necessary that the physical station interface has been initialized beforehand.
 *
 * @param handle
 * @param macAddr Primary MAC address
 * @param config The user configuration
 * @param bdrConfig Array of buffer configurations (for each queue/ring)
 * @return status_t
 */
status_t EP_Init(ep_handle_t *handle, uint8_t *macAddr, const ep_config_t *config, const netc_bdr_config_t *bdrConfig);

/*!
 * @brief De-initialize the endpoint.
 *
 * @param handle
 * @return status_t
 */
status_t EP_Deinit(ep_handle_t *handle);

/*!
 * @brief Get the default configuration.
 *
 * @param config
 * @return status_t
 */
status_t EP_GetDefaultConfig(ep_config_t *config);

/*!
 * @brief Enable MAC transmission/reception
 * To be called when the PHY link is up.
 *
 * @param handle
 * @param speed
 * @param duplex
 * @return status_t
 */
status_t EP_Up(ep_handle_t *handle, netc_hw_mii_speed_t speed, netc_hw_mii_duplex_t duplex);

/*!
 * @brief Disable MAC transmission/reception
 * To be called when the PHY link is down.
 * @note Must ensure all active Tx rings finish current transmission before call this API.
 *
 * @param handle
 * @return status_t
 */
status_t EP_Down(ep_handle_t *handle);

/*!
 * @brief Set the Primary MAC address.
 *
 * @param handle
 * @param macAddr
 * @return status_t
 */
status_t EP_SetPrimaryMacAddr(ep_handle_t *handle, uint8_t *macAddr);

/*!
 * @brief Configure SI based Vlan Insert/Removal
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t EP_ConfigVlanOffload(ep_handle_t *handle, netc_si_vlan_offload_config_t *config);

/*!
 * @brief Set EP port speed
 *
 * @param handle
 * @param pSpeed
 */
static inline void EP_SetPortSpeed(ep_handle_t *handle, uint16_t pSpeed)
{
    NETC_PortSetSpeed(handle->hw.portGroup.port, pSpeed);
}

/*! @} */ // end of netc_ep_config
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_config
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_ntmp
#endif
/*! @addtogroup netc_ep_ntmp
 * @{
 */

/*!
 * @brief Initialize endpoint command BD ring
 *
 * @param handle
 * @param config The command BD ring configuration
 * @return status_t
 */
status_t EP_CmdBDRInit(ep_handle_t *handle, const netc_cmd_bdr_config_t *config);

/*!
 * @brief Deinit endpoint command BD ring
 *
 * @param handle
 * @return status_t
 */
status_t EP_CmdBDRDeinit(ep_handle_t *handle);

/*! @} */ // end of netc_ep_ntmp
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_ntmp
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_rx
#endif
/*! @addtogroup netc_ep_rx
 * @{
 */

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Rx Parser
#endif
/*!
 * @brief Configure Parser in Receive Data Path
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t EP_RxParserConfig(ep_handle_t *handle, netc_port_parser_config_t *config)
{
    NETC_PortSetParser(handle->hw.portGroup.port, config);
    return kStatus_Success;
}
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Rx Parser
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Vlan classification
#endif
/*!
 * @brief Configure the customer vlan type
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t EP_RxVlanCInit(ep_handle_t *handle, const netc_vlan_classify_config_t *config)
{
    NETC_RxVlanCInit(handle->hw.common, config, false);
    return kStatus_Success;
}

/*!
 * @brief Configure the Accepted Vlan.
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t EP_RxVlanCConfigPort(ep_handle_t *handle, netc_port_vlan_classify_config_t *config)
{
    NETC_PortSetVlanClassify(handle->hw.portGroup.port, config);
    return kStatus_Success;
}

/*!
 * @brief Configure the Native outer Vlan
 *
 * @param handle
 * @param useInZeroVlan
 * @param useInNoVlan
 * @param vlan
 * @return status_t
 */
status_t EP_RxVlanClsConfigNativeOuterVlan(ep_handle_t *handle, bool useInZeroVlan, bool useInNoVlan, netc_vlan_t vlan);

/*!
 * @brief Enable VLAN to IPV map with provided data or Disable Vlan to IPV map
 *
 * @param handle
 * @param enable
 * @param map See SICVLANR0/1
 * @return status_t
 */
status_t EP_RxVlanClsMapVlanToIPV(ep_handle_t *handle, bool enable, uint64_t map);

/*!
 * @brief Configure the Native inner Vlan
 *
 * @param handle
 * @param useInZeroVlan
 * @param useInNoVlan
 * @param vlan
 * @return status_t
 */
status_t EP_RxVlanCConfigNativeInnerVlan(ep_handle_t *handle, bool useInZeroVlan, bool useInNoVlan, netc_vlan_t vlan);

/*!
 * @brief Enable/Disable Outter as Inner Vlan if only one Vlan tag is found
 *
 * @param handle
 * @param enable
 * @return status_t
 */
status_t EP_RxVlanCEnableVlanOuterAsInner(ep_handle_t *handle, bool enable);
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Vlan classification
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region PSFP
#endif
/*!
 * @brief Enable / Disable Ingress Port Filtering
 *
 * Applied for both Switch and ENETC
 *
 * @param handle
 * @param config IPF general features
 * @return status_t
 */
status_t EP_RxIPFInit(ep_handle_t *handle, netc_ep_ipf_config_t *config);

/*!
 * @brief Get remaining available word number (words size is 6 bytes) of the ingress Port Filter Table.
 * @note  This is a ternary match table, and the entries can vary in size, from 2 to 14 words.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxIPFGetTableRemainWordNum(ep_handle_t *handle)
{
    return (handle->hw.common->IPFTCAPR & NETC_SW_ENETC_IPFTCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->IPFTMOR & NETC_SW_ENETC_IPFTMOR_NUM_WORDS_MASK);
}

/*!
 * @brief Add an entry for the ingress Port Filter Table.
 *
 * This function do an add & query with return hardware id which can be used as future query / delete / update.
 *
 * @param handle
 * @param config  IPF instance configuaration
 * @param entryID  The table entry ID read out
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxIPFAddTableEntry(ep_handle_t *handle, netc_tb_ipf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update entry in the ingress Port Filter Table.
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxIPFUpdateTableEntry(ep_handle_t *handle, uint32_t entryID, netc_tb_ipf_cfge_t *cfg);

/*!
 * @brief Delete an entry for the ingress Port Filter Table.
 *
 * @param handle
 * @param entryID  The table entry ID
 * @return status_t
 */
status_t EP_RxIPFDelTableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Reset the counter of an ingress port filter entry
 *
 * @param handle
 * @param entryID  The table entry ID
 * @return status_t
 */
status_t EP_RxIPFResetMatchCounter(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get the matched count for entry in IPF
 *
 * @param handle
 * @param entryID  The table entry ID
 * @param count  A count of how many times this entry has been matched.
 * @return status_t
 */
status_t EP_RxIPFGetMatchedCount(ep_handle_t *handle, uint32_t entryID, uint64_t *count);

/*!
 * @brief Init the ENETC PSFP, inlcude
 *
 * @param handle
 * @param config
 * @return status_t
 */
static inline status_t EP_RxPSFPInit(ep_handle_t *handle, const netc_ep_psfp_config_t *config)
{
    NETC_PSFPKcProfileInit(handle->hw.common, &config->kcRule[0], false);
    NETC_PortSetISI(handle->hw.portGroup.port, &config->isiPortConfig);
    return kStatus_Success;
}

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of stream identification table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream Filter,
 *       table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetISITableRemainEntryNum(ep_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add an entry into the stream identification table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddISITableEntry(ep_handle_t *handle, netc_tb_isi_config_t *config, uint32_t *entryID);

/*!
 * @brief Delete an entry in the stream identification table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPDelISITableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of ingress stream table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetISTableRemainEntryNum(ep_handle_t *handle)
{
    return (handle->hw.common->ISITCAPR & NETC_SW_ENETC_ISITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ISITOR & NETC_SW_ENETC_ISITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add an entry into the ingress stream table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddISTableEntry(ep_handle_t *handle, netc_tb_is_config_t *config);

/*!
 * @brief Update an entry in the ingress stream table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPUpdateISTableEntry(ep_handle_t *handle, netc_tb_is_config_t *config);

/*!
 * @brief Delete an entry in the stream identification table
 *
 * @param handle
 * @param entryID
 * @return status_t
 */
status_t EP_RxPSFPDelISTableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number (entry size is 24 bytes) of ingress stream filter table
 * @note This is a Exact Match hash table, and it shares the remaining available entries with Ingress Stream
 *       Identification table.
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetISFTableRemainEntryNum(ep_handle_t *handle)
{
    return (handle->hw.common->HTMCAPR & NETC_SW_ENETC_HTMCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->HTMOR & NETC_SW_ENETC_HTMOR_AMOUNT_MASK);
}

/*!
 * @brief Add an entry into the ingress stream filter table
 *
 * @param handle
 * @param config
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddISFTableEntry(ep_handle_t *handle, netc_tb_isf_config_t *config, uint32_t *entryID);

/*!
 * @brief Update an entry into the ingress stream filter table
 *
 * @param handle
 * @param entryID
 * @param cfg
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPUpdateISFTableEntry(ep_handle_t *handle, uint32_t entryID, netc_tb_isf_cfge_t *cfg);

/*!
 * @brief Del an entry into the stream filter table
 *
 * @param handle
 * @param entryID
 * @return status_t
 */
status_t EP_RxPSFPDelISFTableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of Rate Policying table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetRPTableRemainEntryNum(ep_handle_t *handle)
{
    return (handle->hw.common->RPITCAPR & NETC_SW_ENETC_RPITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->RPITOR & NETC_SW_ENETC_RPITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry to Rate Policying table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddRPTableEntry(ep_handle_t *handle, netc_tb_rp_config_t *config);

/*!
 * @brief Update entry in Rate Policying table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPUpdateRPTableEntry(ep_handle_t *handle, netc_tb_rp_config_t *config);

/*!
 * @brief Delete entry in the Rate policying table
 *
 * @param handle
 * @param entryID
 * @return status_t
 */
status_t EP_RxPSFPDelRPTableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get statistic of specified Rate Policer entry
 *
 * @param handle
 * @param entryID
 * @param statis
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPGetRPStatistic(ep_handle_t *handle, uint32_t entryID, netc_tb_rp_stse_t *statis);

/*!
 * @brief Get remaining available entry number of ingress stream count table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetISCTableRemainEntryNum(ep_handle_t *handle)
{
    return (handle->hw.common->ISCITCAPR & NETC_SW_ENETC_ISCITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->ISCITOR & NETC_SW_ENETC_ISCITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry in ingress stream count table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddISCTableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get ingress stream count statistic
 *
 * @param handle
 * @param entryID
 * @param statistic
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPGetISCStatistic(ep_handle_t *handle, uint32_t entryID, netc_tb_isc_stse_t *statistic);

/*!
 * @brief Reset the count of the ingress stream count
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPResetISCStatistic(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get remaining available entry number of stream gate instance table
 * @note This is a dynamic bounded index table, the remaining entry can't be zero before add entry into it
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetSGITableRemainEntryNum(ep_handle_t *handle)
{
    return (handle->hw.common->SGIITCAPR & NETC_SW_ENETC_SGIITCAPR_NUM_ENTRIES_MASK) -
           (handle->hw.common->SGIITOR & NETC_SW_ENETC_SGIITOR_NUM_ENTRIES_MASK);
}

/*!
 * @brief Add entry in stream gate instance table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddSGITableEntry(ep_handle_t *handle, netc_tb_sgi_config_t *config);

/*!
 * @brief Update entry in stream gate instance table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPUpdateSGITableEntry(ep_handle_t *handle, netc_tb_sgi_config_t *config);

/*!
 * @brief Delete entry in stream gate instance table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPDelSGITableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get state of the stream gate instance for specified entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPGetSGIState(ep_handle_t *handle, uint32_t entryID, netc_tb_sgi_sgise_t *state);

/*!
 * @brief Get remaining available words number of Stream Gate Control List table
 * @note This is a dynamic bounded index table, and number of words required for a stream gate
 *       control list is 1+N/2 where N is number of gate time slots in the stream gate control list.
 *       The remaining word should be greater than the want added entry size
 *
 * @param handle
 * @return uint32_t
 */
static inline uint32_t EP_RxPSFPGetSGCLTableRemainWordNum(ep_handle_t *handle)
{
    return (handle->hw.common->SGCLITCAPR & NETC_SW_ENETC_SGCLITCAPR_NUM_WORDS_MASK) -
           (handle->hw.common->SGCLTMOR & NETC_SW_ENETC_SGCLTMOR_NUM_WORDS_MASK);
}

/*!
 * @brief Add entry into Stream Gate Control List Table
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPAddSGCLTableEntry(ep_handle_t *handle, netc_tb_sgcl_gcl_t *config);

/*!
 * @brief Delete entry of Stream Gate Control List Table
 *
 * @param handle
 * @param entryID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPDelSGCLTableEntry(ep_handle_t *handle, uint32_t entryID);

/*!
 * @brief Get Stream Gate Control List Table entry gate control list
 *
 * @param handle
 * @param gcl
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPGetSGCLGateList(ep_handle_t *handle, netc_tb_sgcl_gcl_t *gcl, uint32_t length);

/*!
 * @brief Get state (ref count) for Stream Gate Control List table entry
 *
 * @param handle
 * @param entryID
 * @param state
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxPSFPGetSGCLState(ep_handle_t *handle, uint32_t entryID, netc_tb_sgcl_sgclse_t *state);

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion PSFP
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region L2 Filtering
#endif

/*!
 * @brief Init the L2 MAC Filter for a specified SI
 *
 * @param handle  EP handle
 * @param config  The L2 MAC Filter configuration
 * @return status_t
 */
status_t EP_RxL2MFInit(ep_handle_t *handle, netc_si_l2mf_config_t *config);

/*!
 * @brief Add entry into the MAC address hash filter with given MAC address
 * Hardware layer will not maitain the counter of the hash filter. API layer shall cover this requirement.
 *
 * @param handle  EP handle
 * @param type  Unicast or multicast MAC address
 * @param macAddr  MAC address to be added in filter table
 * @return status_t
 */
status_t EP_RxL2MFAddHashEntry(ep_handle_t *handle, netc_packet_type_t type, uint8_t *macAddr);

/*!
 * @brief Delete entry into the MAC address hash filter with given MAC address
 * Hardware layer will not maitain the counter of the hash filter. API layer shall cover this requirement.
 *
 * @param handle  EP handle
 * @param type  Unicast or multicast MAC address
 * @param macAddr  MAC address to be deleted from filter table
 * @return status_t
 */
status_t EP_RxL2MFDelHashEntry(ep_handle_t *handle, netc_packet_type_t type, uint8_t *macAddr);

/*!
 * @brief Add entry into the MAC filter exact match table
 *
 * The entry is associated to the current Station Interface
 *
 * @param handle
 * @param idx      Index in the entry table
 * @param macAddr  MAC address for filter
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxL2MFAddEMTableEntry(ep_handle_t *handle, uint32_t idx, uint8_t *macAddr);

/*!
 * @brief Delete entry into the MAC filter exact match table
 *
 * @param handle  EP handle
 * @param idx  Index in the entry table
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxL2MFDelEMTableEntry(ep_handle_t *handle, uint32_t idx);

// L2 Vlan Filter Table
/*!
 * @brief For VLAN filter, use inner vlan tag or outer vlan tag
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t EP_RxL2VFInit(ep_handle_t *handle, netc_si_l2vf_config_t *config);

/*!
 * @brief Add entry into the VLAN hash filter with given MAC address
 * Hardware layer will not maitain the counter of the hash filter. API layer shall cover this requirement.
 *
 * @param handle
 * @param vlanId  VLAN identifier for filter
 * @return status_t
 */
status_t EP_RxL2VFAddHashEntry(ep_handle_t *handle, uint16_t vlanId);

/*!
 * @brief Delete entry into the VLAN hash filter with given MAC address
 * Hardware layer will not maitain the counter of the hash filter. API layer shall cover this requirement.
 *
 * @param handle
 * @param vlanId  VLAN identifier for filter
 * @return status_t
 */
status_t EP_RxL2VFDelHashEntry(ep_handle_t *handle, uint16_t vlanId);

/*!
 * @brief Add entry into the MAC filter exact match table
 *
 * The entry is associated to the current Station Interface
 *
 * @param handle
 * @param idx     Index in the entry table
 * @param vlanId  VLAN identifier
 * @param tpid    VLAN TPID
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxL2VFAddEMTableEntry(ep_handle_t *handle, uint32_t idx, uint16_t vlanId, netc_vlan_tpid_select_t tpid);

/*!
 * @brief Delete entry into the VLAN filter exact match table
 *
 * @param handle
 * @param idx  Index in the entry table
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_RxL2VFDelEMTableEntry(ep_handle_t *handle, uint32_t idx);

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion L2 Filtering
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region ICM
#endif
/*!
 * @brief Configure the Ingress Congestion Management for specified port
 *
 * @param handle
 * @param config
 * @return status_t
 */
status_t EP_RxICMConfig(ep_handle_t *handle, netc_enetc_port_icm_config_t *config);

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion ICM
#endif

/*!
 * @brief Set the received Frame vlan to IPV mapping
 *
 * @param handle
 * @param vlan  Frame VLAN tag.
 * @param ipv  The IPV value to be mapped.
 * @return status_t
 */
static inline status_t EP_RxMapVlanToIpv(ep_handle_t *handle, netc_vlan_t vlan, uint8_t ipv)
{
    status_t result = kStatus_Success;

    if (ipv > 7U)
    {
        result = kStatus_InvalidArgument;
    }
    else
    {
        NETC_SIMapVlanToIpv(handle->hw.si, (uint8_t)(vlan.pcp << 1U | vlan.dei), ipv);
    }

    return result;
}

/*!
 * @brief Set the IPV to Rx ring mapping
 *
 * @param handle
 * @param ipv  IPV value to be mapped.
 * @param ring  The Rx BD ring index to be mapped.
 * @return status_t
 */
static inline status_t EP_RxMapIpvToRing(ep_handle_t *handle, uint8_t ipv, uint8_t ring)
{
    if ((ipv > 7U) || (ring >= handle->cfg.ringPerBdrGroup))
    {
        return kStatus_InvalidArgument;
    }
    else
    {
        NETC_SIMapIpvToRing(handle->hw.si, ipv, ring);
        return kStatus_Success;
    }
}

/*!
 * @brief Set the default used receive Rx BD ring group.
 * @note The IPV mapped ring index is the relative index inside the default used group.
 *
 * @param handle
 * @param groupIdx  The default Rx group index.
 * @return status_t
 */
static inline status_t EP_RxSetDefaultBDRGroup(ep_handle_t *handle, netc_hw_enetc_si_rxr_group groupIdx)
{
    if (((uint8_t)groupIdx >= handle->cfg.rxBdrGroupNum) && (groupIdx != kNETC_SiBDRGroupOne))
    {
        /* Can't selected non existing group */
        return kStatus_InvalidArgument;
    }
    else
    {
        NETC_SISetDefaultRxBDRGroup(handle->hw.si, groupIdx);
        return kStatus_Success;
    }
}

/*! @} */ // end of netc_ep_rx
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_rx
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_tx
#endif
/*! @addtogroup netc_ep_tx
 * @{
 */

/*!
 * @brief Config the Time Gate Scheduling entry admin gate control list
 *
 * This function is used to program the Enhanced Scheduled Transmisson. (IEEE802.1Qbv)
 *
 * @param handle
 * @param config
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_TxTGSConfigAdminGcl(ep_handle_t *handle, netc_tb_tgs_gcl_t *config);

