JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.h
/*!
 * @brief Enable the EP port time gate scheduling
 *
 * @param handle
 * @param enable
 * @param gateState
 * @return status_t
 */
#if (defined(FSL_FEATURE_NETC_HAS_ERRATA_051130) && FSL_FEATURE_NETC_HAS_ERRATA_051130)
status_t EP_TxPortTGSEnable(ep_handle_t *handle, bool enable, uint8_t gateState);
#else
status_t EP_TxPortTGSEnable(ep_handle_t *handle, bool enable);
#endif

/*!
 * @brief Get Time Gate Scheduling entry operation gate control list
 *
 * This function is used to read the Enhanced Scheduled Transmisson. (IEEE802.1Qbv)
 *
 * @param handle
 * @param gcl
 * @param length
 * @return status_t
 * @return See @ref netc_cmd_error_t
 */
status_t EP_TxtTGSGetOperGcl(ep_handle_t *handle, netc_tb_tgs_gcl_t *gcl, uint32_t length);

/*!
 * @brief Config the TC (traffic class) property
 *
 * @param handle
 * @param tcIdx
 * @param config
 * @return status_t
 */
status_t EP_TxTrafficClassConfig(ep_handle_t *handle, netc_hw_tc_idx_t tcIdx, const netc_port_tx_tc_config_t *config);

/*!
 * @brief Get status of the Traffic class
 *
 * @param handle
 * @param curState
 * @param aheadState
 * @return status_t
 */
status_t EP_TxTrafficClassGetState(ep_handle_t *handle, bool *curState, bool *aheadState);

/*! @} */ // end of netc_ep_tx
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_tx
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_stat
#endif
/*! @addtogroup netc_ep_stat
 * @{
 */

/*!
 * @brief Get the ENETC port discard statistic and reason
 *
 * Get the discarded count of frames and its reasons.
 *
 * @param handle
 * @param useTx true - Tx port.  false - Rx port.
 * @param statistic pointer to the statistic data
 * @return status_t
 */
static inline status_t EP_GetPortDiscardStatistic(ep_handle_t *handle,
                                                  bool useTx,
                                                  netc_port_discard_statistic_t *statistic)
{
    NETC_PortGetDiscardStatistic(handle->hw.portGroup.port, (useTx) ? kNETC_TxDiscard : kNETC_RxDiscard, statistic);
    return kStatus_Success;
}

/*!
 * @brief Clean the EP Port Rx discard reason. Set the related bits to 1 to clear the specific reasons
 *
 * @param handle
 * @param useTx true - Tx port.  false - Rx port.
 * @param reason0
 * @param reason1
 * @return status_t
 */
static inline status_t EP_ClearPortDiscardReason(ep_handle_t *handle, bool useTx, uint32_t reason0, uint32_t reason1)
{
    NETC_PortClearDiscardReason(handle->hw.portGroup.port, (useTx) ? kNETC_TxDiscard : kNETC_RxDiscard, reason0,
                                reason1);
    return kStatus_Success;
}

/*!
 * @brief Get EP port time gate scheduling gate list status
 *
 * @param handle
 * @return Port status flags which are ORed by the enumerators in the @ref netc_port_tgsl_status_t
 */
static inline uint32_t EP_GetPortTGSListStatus(ep_handle_t *handle)
{
    return NETC_PortGetTGSListStatus(handle->hw.portGroup.port);
}

/*! @} */ // end of netc_ep_stat
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_stat
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_interrupt
#endif
/*! @addtogroup netc_ep_interrupt
 * @{
 */
/*!
 * @brief Enable interrupts
 *
 * @param handle
 * @param mask see @ref _ep_interrupt_flag
 * @return status_t
 */
status_t EP_EnableInterrupt(ep_handle_t *handle, uint32_t mask);

/*!
 * @brief Disable interrupts
 *
 * @param handle
 * @param mask
 * @return status_t
 */
status_t EP_DisableInterrupt(ep_handle_t *handle, uint32_t mask);

/*!
 * @brief Clean the SI transmit interrupt flags
 *
 * @param handle    The EP handle.
 * @param txFrameIntrMask  IPV value to be mapped, bit x represents ring x.
 * @param txThresIntrMask  The Rx BD ring index to be mapped, bit x represents ring x.
 */
static inline void EP_CleanTxIntrFlags(ep_handle_t *handle, uint16_t txFrameIntrMask, uint16_t txThresIntrMask)
{
    NETC_SICleanTxIntrFlags(handle->hw.si, txFrameIntrMask, txThresIntrMask);
}

/*!
 * @brief Clean the SI receive interrupt flags
 *
 * @param handle    The EP handle.
 * @param rxIntrMask  Rx interrupt bit mask, bit x represents ring x.
 */
static inline void EP_CleanRxIntrFlags(ep_handle_t *handle, uint32_t rxIntrMask)
{
    NETC_SICleanRxIntrFlags(handle->hw.si, rxIntrMask);
}

/*!
 * @brief Set the global MSIX mask status
 *
 * This function masks/unmasks global MSIX message.
 * Mask - All of the vectors are masked, regardless of their per-entry mask bit states.
 * Unmask - Each entry's mask status determines whether the vector is masked or not.
 *
 * @param handle    The EP handle
 * @param mask      The mask state. True: Mask, False: Unmask.
 * @return status_t
 */
status_t EP_MsixSetGlobalMask(ep_handle_t *handle, bool mask);

/*!
 * @brief Set the MSIX entry mask status for specified entry
 *
 * This function masks/unmasks MSIX message for specified entry.
 *
 * @param handle    The EP handle
 * @param entryIdx  The entry index in the table.
 * @param mask      The mask state. True: Mask, False: Unmask.
 * @return status_t
 */
status_t EP_MsixSetEntryMask(ep_handle_t *handle, uint8_t entryIdx, bool mask);

/*!
 * @brief Get the MSIX pending status in MSIX PBA table
 *
 * This function is to get the entry pending status from MSIX PBA table. If interrupt occurs but masked by vector
 * control of entry, pending bit in PBA will be set.
 *
 * @param handle  The EP handle
 * @param pbaIdx  The index of PBA array with 64-bit unit.
 * @param status  Pending status bit mask, bit n for entry n.
 * @return status_t
 */
status_t EP_MsixGetPendingStatus(ep_handle_t *handle, uint8_t pbaIdx, uint64_t *status);

/*! @} */ // end of netc_ep_interrupt
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_interrupt
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_xfer
#endif
/*! @addtogroup netc_ep_xfer
 * @{
 */
/*!
 * @brief Common part for transfer regular frame or Switch management frame.
 * @note This function is internal used. Please use EP_SendFrame() or SWT_SendFrame() API to send frames.
 *
 * @param handle
 * @param txBdRing The Transmit buffer descriptor ring handle
 * @param hwRing The hardware Tx ring index
 * @param frame The frame descriptor pointer
 * @param context Private context provided back by ep_reclaim_cb_t
 * @param txDesc Point to the Transmits BD Description array.
 * @param txCacheMaintain Enable/Disable Tx buffer Cache Maintain.
 * @retval status_t
 */
status_t EP_SendFrameCommon(ep_handle_t *handle,
                            netc_tx_bdr_t *txBdRing,
                            uint8_t hwRing,
                            netc_frame_struct_t *frame,
                            void *context,
                            netc_tx_bd_t *txDesc,
                            bool txCacheMaintain);

/*!
 * @brief Transmits a frame for specified ring.
 * This API is zero-copy and requires the ep_reclaim_cb_t to be called to free the transmitted frame.
 *
 * @param handle
 * @param ring The ring index
 * @param frame The frame descriptor pointer
 * @param context Private context provided back by ep_reclaim_cb_t
 * @param opt Additional tx options. If NULL, default is tx timestamping enabled, no start time and no masquerading.
 * @retval status_t
 */
status_t EP_SendFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, void *context, ep_tx_opt *opt);

/*!
 * @brief Wait until the EP Tx ring has completed the transfer.
 *
 * @note Only call after EP_SendFrame() to do a no-interrupt transfer
 *
 * @param handle
 * @param ring The ring index
 */
static inline void EP_WaitUnitilTxComplete(ep_handle_t *handle, uint8_t ring)
{
    uint8_t hwRing = ring;
    if (NETC_EnetcHasManagement(handle->hw.base) && (getSiNum(handle->cfg.si) == 0U))
    {
        /* Switch management ENETC Tx BD hardware ring 0 can't be used to send regular frame, so the index need increase
         * 1 */
        hwRing++;
    }
    while (handle->hw.si->BDR[hwRing].TBCIR != handle->txBdRing[ring].producerIndex)
    {
    }
}
/*!
 * @brief Common part of Reclaim tx descriptors for regular frame or Switch management frame.
 * @note This function is internal used. Please use EP_ReclaimTxDescriptor() or SWT_ReclaimTxDescriptor() API to Reclaim
 * tx descriptors.
 *
 * @param handle
 * @param txBdRing The Transmit buffer descriptor ring handle
 * @param hwRing The hardware Tx ring index
 * @param enCallback Enable/Disable call the Tx Reclaim callback functions.
 */
netc_tx_frame_info_t *EP_ReclaimTxDescCommon(ep_handle_t *handle,
                                             netc_tx_bdr_t *txBdRing,
                                             uint8_t hwRing,
                                             bool enCallback);

/*!
 * @brief Reclaim tx descriptors.
 * This function is used to update the tx descriptor status and
 * get the tx timestamp. For each reclaimed transmit frame the
 * ep_reclaim_cb_t is called.
 *
 * This is called after being notified of a transmit completion from ISR.
 * It runs until there are no more frames to be reclaimed in the BD ring.
 *
 * @param handle
 * @param ring The ring index
 */
void EP_ReclaimTxDescriptor(ep_handle_t *handle, uint8_t ring);

/*!
 * @brief Common part of receives one frame with zero copy from specified ring
 *
 * @note This function is internal used. Please use EP_ReceiveFrame() or SWT_ReceiveFrame() API.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param ring Ring index
 * @param frame Frame buffer point
 * @param attr Frame attribute pointer
 * @param isDrop Whether Frame need be drop
 * @param rxCacheMaintain Enable/Disable Rx buffer Cache maintain
 * @return status_t
 */
status_t EP_ReceiveFrameCommon(ep_handle_t *handle,
                               netc_rx_bdr_t *rxBdRing,
                               uint8_t ring,
                               netc_frame_struct_t *frame,
                               netc_frame_attr_t *attr,
                               bool isDrop,
                               bool rxCacheMaintain);

/*!
 * @brief Receives one frame with zero copy from specified ring
 *
 * @note The sufficient rx frame data structure MUST be provided by appliction.
 *
 * @param handle
 * @param ring The ring index
 * @param frame The frame descriptor pointer
 * @param attr Frame attribute pointer
 * @return kStatus_Success                Successfully receive a regular frame
 * @return kStatus_NETC_RxHRNotZeroFrame  Frame in Rx BD ring is management frame, need call SWT_ReceiveFrame()
 * @return kStatus_NETC_RxTsrResp         Frame in Rx BD ring is Transmit Timestamp Reference Response messages, need
 *                                        call SWT_GetTimestampRefResp() to get Transmit Timestamp Reference Response
 * @return kStatus_NETC_RxFrameEmpty      Rx BD ring is empty
 * @return kStatus_NETC_RxFrameError      Frame in Rx BD ring has error, need be dropped
 * @return kStatus_InvalidArgument        Rx BD ring index is out of range
 * @return kStatus_NETC_LackOfResource    Appliction provided buffer is not enough
 */
status_t EP_ReceiveFrame(ep_handle_t *handle, uint8_t ring, netc_frame_struct_t *frame, netc_frame_attr_t *attr);

/*!
 * @brief Common part of receive regular frame or Switch management frame which will be copied in the provided buffer
 *
 * @note This function is internal used. Please use EP_ReceiveFrameCopy() or SWT_ReceiveFrameCopy() API.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param ring Ring index
 * @param buffer Buffer address
 * @param length Buffer length
 * @param attr Frame attribute pointer
 * @param rxCacheMaintain Enable/Disable Rx buffer Cache maintain
 * @return status_t
 */
status_t EP_ReceiveFrameCopyCommon(ep_handle_t *handle,
                                   netc_rx_bdr_t *rxBdRing,
                                   uint8_t ring,
                                   void *buffer,
                                   uint32_t length,
                                   netc_frame_attr_t *attr,
                                   bool rxCacheMaintain);

/*!
 * @brief Receives one frame which will be copied in the provided buffer from specified ring
 *
 * @note The buffer size MUST be queried using EP_GetRxFrameSize() beforehand.
 *
 * @param handle
 * @param ring Ring index
 * @param buffer Buffer address
 * @param length Buffer length
 * @param attr Frame attribute pointer
 * @return kStatus_Success                Successfully receive a regular frame
 * @return kStatus_InvalidArgument        Rx BD ring index is out of range
 */
status_t EP_ReceiveFrameCopy(ep_handle_t *handle, uint8_t ring, void *buffer, uint32_t length, netc_frame_attr_t *attr);

/*!
 * @brief Common part of get pending frame size API for regular frame or Switch management frame.
 * @note This function is internal used. Please use EP_GetRxFrameSize() or SWT_GetRxFrameSize() API.
 *
 * @param handle
 * @param rxBdRing Rx BD ring handle
 * @param length The length of the valid frame received.
 * @return status_t
 */
status_t EP_GetRxFrameSizeCommon(ep_handle_t *handle, netc_rx_bdr_t *rxBdRing, uint32_t *length);

/*!
 * @brief Gets the size of the pending frame in the specified receive ring buffer.
 *
 * @note Frame size without FCS
 *
 * @param handle The ENET handler structure. This is the same handler pointer used in the ENET_Init.
 * @param ring The ring index
 * @param length The length of the valid frame received.
 * @return kStatus_Success                Successfully get the length of a regular frame
 * @return kStatus_NETC_RxHRNotZeroFrame  Frame in Rx BD ring is management frame, need call SWT_GetRxFrameSize() to get
 *                                        frame size
 * @return kStatus_NETC_RxTsrResp         Frame in Rx BD ring is Transmit Timestamp Reference Response messages, need
 *                                        call SWT_GetTimestampRefResp() to get Transmit Timestamp Reference Response
 * @return kStatus_NETC_RxFrameEmpty      Rx BD ring is empty
 * @return kStatus_NETC_RxFrameError      Frame in Rx BD ring has error, need be dropped
 * @return kStatus_InvalidArgument        Rx BD ring index is out of range
 */
status_t EP_GetRxFrameSize(ep_handle_t *handle, uint8_t ring, uint32_t *length);

