JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc_endpoint.h
/*! @} */ // end of netc_ep_xfer
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_xfer
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_ep_psi_vsi_msg
#endif
/*! @addtogroup netc_ep_psi_vsi_msg
 * @{
 */

/*!
 * @brief PSI enables/disables specified interrupt
 *
 * @param handle  The EP handle.
 * @param mask  The interrupt mask, refer to #netc_psi_msg_flags_t which should be OR'd together.
 * @param enable  Enable/Disable the interrupt.
 */
void EP_PsiEnableInterrupt(ep_handle_t *handle, uint32_t mask, bool enable);

/*!
 * @brief PSI gets interrupt event flag status
 *
 * @param handle  The EP handle.
 * @return The interrupt mask, refer to #netc_psi_msg_flags_t which should be OR'd together.
 */
uint32_t EP_PsiGetStatus(ep_handle_t *handle);

/*!
 * @brief PSI clears interrupt event flag
 *
 * @param handle  The EP handle.
 * @param mask  The interrupt mask, refer to #netc_psi_msg_flags_t which should be OR'd together.
 */
void EP_PsiClearStatus(ep_handle_t *handle, uint32_t mask);

/*!
 * @brief PSI sends message to specified VSI(s)
 *
 * @param handle  The EP handle.
 * @param msg  The message to be sent.
 * @param vsi  The VSI number.
 * @return status_t
 */
status_t EP_PsiSendMsg(ep_handle_t *handle, uint16_t msg, netc_vsi_number_t vsi);

/*!
 * @brief PSI checks Tx busy flag which should be cleaned when VSI receive the message data
 *
 * @param handle  The EP handle.
 * @param vsi  The VSI number.
 * @return The busy status of specified VSI.
 */
bool EP_PsiCheckTxBusy(ep_handle_t *handle, netc_vsi_number_t vsi);

/*!
 * @brief PSI sets Rx buffer to receive message from specified VSI
 * @note The buffer memory size should be big enough for the message data from VSI
 *
 * @param handle  The EP handle.
 * @param vsi  The VSI number.
 * @param buffAddr  The buffer address to store message data from VSI.
 */
status_t EP_PsiSetRxBuffer(ep_handle_t *handle, netc_vsi_number_t vsi, uint64_t buffAddr);

/*!
 * @brief PSI gets Rx message from specified VSI
 *
 * @param handle  The EP handle.
 * @param vsi  The VSI number.
 * @param msgInfo  The Rx message information.
 */
status_t EP_PsiGetRxMsg(ep_handle_t *handle, netc_vsi_number_t vsi, netc_psi_rx_msg_t *msgInfo);

/*!
 * @brief Enable VSI interrupt
 *
 * @param handle  The EP handle.
 * @param mask  The interrupt mask, see #netc_vsi_msg_flags_t which should be OR'd together.
 * @param enable  Enable/Disable interrupt.
 */
void EP_VsiEnableInterrupt(ep_handle_t *handle, uint32_t mask, bool enable);

/*!
 * @brief Get VSI interrupt status
 *
 * @param handle  The EP handle.
 * @return A bitmask composed of #netc_vsi_msg_flags_t enumerators OR'd together.
 */
uint32_t EP_VsiGetStatus(ep_handle_t *handle);

/*!
 * @brief Clear VSI interrupt status
 *
 * @param handle  The EP handle.
 * @param mask  The interrupt mask, see #netc_vsi_msg_flags_t which should be OR'd together.
 */
void EP_VsiClearStatus(ep_handle_t *handle, uint32_t mask);

/*!
 * @brief VSI sends message to PSI
 *
 * @param handle  The EP handle.
 * @param msgAddr  Address to store message ready to be sent, must be 64 bytes aligned.
 * @param msgLen  The message length, must be 32 bytes aligned.
 * @return status_t
 */
status_t EP_VsiSendMsg(ep_handle_t *handle, uint64_t msgAddr, uint32_t msgLen);

/*!
 * @brief Check VSI Tx status
 *
 * @param handle  The EP handle.
 * @param status  The VSI Tx status structure.
 */
void EP_VsiCheckTxStatus(ep_handle_t *handle, netc_vsi_msg_tx_status_t *status);

/*!
 * @brief VSI receives message from PSI
 *
 * @param handle  The EP handle.
 * @param msg  The message from PSI.
 * @return status_t
 */
status_t EP_VsiReceiveMsg(ep_handle_t *handle, uint16_t *msg);

/*! @} */ // end of netc_ep_psi_vsi_msg
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_ep_psi_vsi_msg
#endif

#if defined(__cplusplus)
}
#endif
#endif /* _FSL_NETC_ENDPOINT_H_ */
